[
  {
    "title": "Francois0203 Portfolio Website",
    "subtitle": "Modern React-Based Personal Portfolio & Professional Showcase",
    "description": "A professionally designed personal portfolio website built with React, showcasing projects, skills, and experience through an interactive, responsive interface. Features a modern design system with theme switching, animated components, and optimized performance. The site demonstrates full-stack development capabilities, responsive design principles, and attention to user experience across all device types.",
    "techStack": [
      { "name": "React", "icon": "FaReact", "color": "#61DAFB" },
      { "name": "JavaScript", "icon": "FaCode", "color": "#F7DF1E" },
      { "name": "CSS Modules", "icon": "FaPalette", "color": "#1572B6" },
      { "name": "React Router", "icon": "FaCogs", "color": "#CA4245" },
      { "name": "GitHub Pages", "icon": "AiOutlineDeploymentUnit", "color": "#222222" }
    ],
    "features": [
      {
        "title": "Responsive Design System",
        "description": "Fully responsive layout that adapts seamlessly to desktop, tablet, and mobile devices. Features a comprehensive theme system with light/dark mode switching and CSS custom properties for consistent styling across all components.",
        "icon": "FaPalette"
      },
      {
        "title": "Interactive Components",
        "description": "Custom-built reusable React components including navigation, modals, tooltips, toast notifications, and form elements. Features smooth animations, ripple effects, and particle systems that adapt to device capabilities and user preferences.",
        "icon": "MdAutoAwesome"
      },
      {
        "title": "Performance Optimized",
        "description": "Optimized for fast load times and smooth interactions with lazy loading, code splitting, and efficient rendering. Animations automatically reduce on mobile devices and respect user's motion preferences for accessibility.",
        "icon": "MdSpeed"
      },
      {
        "title": "GitHub Pages Deployment",
        "description": "Automated deployment pipeline using GitHub Actions, enabling seamless updates and continuous delivery. Hosted on GitHub Pages with custom domain support and HTTPS enforcement.",
        "icon": "FaRocket"
      }
    ],
    "summary": "A modern, professionally-designed portfolio website showcasing technical skills, projects, and experience through an engaging, responsive interface.",
    "highlights": [
      "Designed and implemented complete UI/UX with modern design principles and accessibility in mind",
      "Built reusable component library with consistent theming and responsive layouts",
      "Implemented performance optimizations including lazy loading and reduced animations for mobile devices",
      "Configured automated deployment pipeline for continuous delivery",
      "Created interactive animations and effects that enhance user experience without compromising performance"
    ],
    "links": [
      { "label": "View Repository", "url": "https://github.com/Francois0203", "icon": "FaGithub" }
    ]
  },
  {
    "title": "Telescope Correlator",
    "subtitle": "Production-Ready FX Correlator for Radio Telescope Arrays",
    "description": "A professional-grade telescope correlator implementing the FX architecture for processing radio telescope data. This system processes voltage streams from radio telescope antenna arrays and produces visibility data suitable for astronomical image synthesis. Designed for both development (simulation) and production (real telescope) operation modes, it represents a complete signal processing pipeline for radio astronomy applications.",
    "techStack": [
      { "name": "Python", "icon": "FaPython", "color": "#3776AB" },
      { "name": "NumPy", "icon": "SiNumpy", "color": "#013243" },
      { "name": "Docker", "icon": "FaDocker", "color": "#2496ED" },
      { "name": "pytest", "icon": "SiPytest", "color": "#0A9EDC" },
      { "name": "Signal Processing", "icon": "MdRadio", "color": "#FF6B6B" },
      { "name": "Radio Astronomy", "icon": "MdScience", "color": "#4ECDC4" }
    ],
    "features": [
      {
        "title": "FX Correlator Architecture",
        "description": "Implements the industry-standard FX correlation pipeline with F-Engine for channelization via windowed FFT (time to frequency domain conversion), X-Engine for cross-correlation and integration between antenna pairs, and geometric delay compensation accounting for array geometry and source position. Processes complex voltage data through the complete correlation pipeline.",
        "icon": "MdRadio"
      },
      {
        "title": "Dual Operation Modes",
        "description": "Features separate development and production modes. Development mode provides simulated telescope data for algorithm testing, validation, and learning without hardware. Production mode handles live network streaming (TCP/UDP protocols) and file processing from real telescope arrays with comprehensive monitoring, quality checks, and calibration support.",
        "icon": "MdSpeed"
      },
      {
        "title": "Network Data Streaming",
        "description": "Real-time processing of telescope data streams via TCP/UDP protocols with configurable buffer management, timeout handling, and quality monitoring. Supports live correlation of data from antenna arrays with automatic stream recovery and comprehensive error handling for production astronomical observations.",
        "icon": "MdCached"
      },
      {
        "title": "Comprehensive Testing",
        "description": "Includes 33 automated tests covering all components: F-Engine channelization accuracy, X-Engine correlation fidelity, geometric delay compensation precision, and end-to-end pipeline validation. Features accuracy validation against analytical solutions ensuring mathematical correctness without requiring physical telescope hardware.",
        "icon": "SiPytest"
      }
    ],
    "architecture": {
      "title": "System Architecture",
      "components": [
        {
          "layer": "Data Ingestion",
          "description": "Frontend module handling simulated data generation for development, network streaming (TCP/UDP) for live observations, and file processing for recorded data. Includes protocol handlers and buffer management."
        },
        {
          "layer": "F-Engine (Channelization)",
          "description": "Applies window functions (Hanning, Hamming, Blackman) and performs FFT to convert time-domain signals to frequency domain. Supports optional quantization for bandwidth reduction and configurable overlap for improved spectral response."
        },
        {
          "layer": "Delay Compensation",
          "description": "Calculates geometric delays based on antenna positions and source direction. Applies phase corrections to align signals accounting for baseline geometry, enabling coherent cross-correlation of signals from distributed antennas."
        },
        {
          "layer": "X-Engine (Correlation)",
          "description": "Cross-correlates all antenna pairs to produce complex visibilities for each frequency channel. Accumulates correlations over integration time and validates physical properties (Hermitian symmetry, real autocorrelations)."
        }
      ]
    },
    "highlights": [
      "Implemented complete FX correlation pipeline with sub-picosecond delay precision and FFT accuracy validation against analytical solutions",
      "Designed dual-mode architecture separating development simulations from production telescope operations with safety features and validation",
      "Built containerized deployment using Docker for reproducible execution across Windows, Linux, and macOS platforms",
      "Developed comprehensive CLI with interactive shells for development and production modes, providing intuitive workflow management",
      "Created 33-test validation suite covering unit tests for each processing stage and integration tests for end-to-end pipeline verification",
      "Implemented real-time network streaming with TCP/UDP support, configurable buffering, and production-grade monitoring and logging"
    ],
    "links": [
      { "label": "View Repository", "url": "https://github.com/Francois0203/Telescope-Correlator", "icon": "FaGithub" }
    ]
  }
]
